[
  {
    "title_en": "Python Instructor & Technical Mentor",
    "title_zh": "Python 教师与技术导师",
    "company_en": "TechBlazers",
    "company_zh": "TechBlazers",
    "period_en": "Jan 2026 – Present",
    "period_zh": "2026 年 1 月 – 现在",
    "location_en": "Toronto, Canada",
    "location_zh": "多伦多, 加拿大",
    "bullets_en": [
      "Engineered an introductory Python curriculum tailored for early learners (grade 5-7), translating core programming concepts, such as sequential logic, loops, and conditional branching, into highly simplified, interactive learning modules.",
      "Lead VEX IQ coaching sessions focused on mechanical logic and iterative problem-solving, guiding students through the design and debugging of modular robotic systems.",
      "Developed specialized coding exercises and assessments that emphasize clean code principles, helping students transition from basic syntax to building functional project portfolios."
    ],
    "bullets_zh": [
      "针对 5-7 年级青少年开发者量身定制 Python 启蒙课程，将顺序逻辑、循环及条件分支等核心编程概念转化为高交互性的模块化教学案例。",
      "主导 VEX IQ 机器人教练工作，专注于机械逻辑与迭代式问题解决，指导学生完成模块化机器人系统的设计、搭建与复杂调试。",
      "研发专项编程练习与评估体系，深度贯彻“洁净代码（Clean Code）”原则，助力学生实现从基础语法掌握到独立完成项目作品集的跨越。"
    ]
  },
  {
    "title_en": "AI Application Engineer (Intern)",
    "title_zh": "AI 应用工程师（实习）",
    "company_en": "SAP SE",
    "company_zh": "SAP SE",
    "period_en": "Apr 2025 - Sept 2025",
    "period_zh": "2025 年 4 月 - 2025 年 9 月",
    "location_en": "Shanghai, China",
    "location_zh": "中国，上海",
    "bullets_en": [
      "Developed core features for Joule AI Assistant using Python and GPT-5. Modernized CI/CD for Joule by architecting a modular GitHub Actions pipeline with Project Piper and Kyma, and automated end-to-end deployment via ArgoCD, eliminating manual synchronization errors.",
      "Implemented an end-to-end testing strategy for Joule and Codengine by building a dual-layer testing suite with Cucumber and Pytest. Maintained ~90% integration and ~95% unit test coverage each sprint and automated daily reporting through a Jenkins pipeline.",
      "Engineered an LLM-powered data pipeline using Python and GPT-5 to categorize partner questions and extract qualitative trends, enabling product managers to prioritize and address top concerns across 7 SAP partners.",
      "Built a centralized Flask-based RESTful API to orchestrate 50+ IoT devices (OrionStar robots), transitioning showroom operations from manual control to an automated system for synchronized international demonstrations."
    ],
    "bullets_zh": [
      "基于 Python 与 GPT-5 深度参与 Joule AI 助手核心功能研发。主导 CI/CD 流程现代化改造，通过 Project Piper 与 Kyma 构建模块化 GitHub Actions 流水线，并利用 ArgoCD 实现端到端自动化部署，彻底解决手动同步导致的生产误差。",
      "为 Joule 与 Codengine 设计并实施双层自动化测试架构（Cucumber + Pytest），确保每个 Sprint 维持 90% 以上的集成测试覆盖率及 95% 的单元测试覆盖率，并通过 Jenkins 实现自动化每日质量报告。",
      "利用 Python 与 GPT-5 构建智能化数据洞察流水线，实现对合作伙伴反馈的自动分类与趋势提取，赋能产品经理针对 7 家核心合作伙伴的需求进行精准优先级排布。",
      "基于 Flask 研发集中式 RESTful API 调度系统，实现对 50 余台 OrionStar 机器人的规模化控制，驱动展厅由人工操作向自动化、同步化国际演示系统的转型。"
    ]
  },
  {
    "title_en": "Full Stack Developer (Part-time)",
    "title_zh": "全栈开发（兼职）",
    "company_en": "Urban Data Research Centre",
    "company_zh": "Urban Data Research Centre",
    "period_en": "Sept 2024 - Apr 2025",
    "period_zh": "2024 年 9 月 - 2025 年 4 月",
    "location_en": "Toronto, Canada",
    "location_zh": "多伦多, 加拿大",
    "bullets_en": [
      "Architected an automated Divide, Conquer, Recheck (DCR) pipeline using Python and GPT4o to extract structured numerical data from 60+ scientific publications; achieved 88% accuracy across 1,464 data points, automating a previously manual research process. (View Code)",
      "Developed an interactive React dashboard for the University of Toronto’s City Digital Twin Project, integrating GraphDB via SPARQL to visualize stratified urban data through map-based indicators and multi-dimensional charts to facilitate complete community analysis and data-driven urban planning. (View Code)"
    ],
    "bullets_zh": [
      "自主研发 DCR（划分-征服-复核）自动化数据流水线，结合 Python 与 GPT-4o 从 60 余篇学术论文中精准提取结构化数值；在 1,464 个数据点上实现 88% 的提取精度，成功将传统人工调研流程自动化。",
      "为多伦多大学“城市数字孪生”项目开发交互式 React 仪表盘，通过 SPARQL 深度集成 GraphDB。利用地图指标与多维图表实现城市数据的分层可视化，为“完整社区”分析与数据驱动的城市规划提供决策支持。"
    ]
  },
  {
    "title_en": "Machine Learning Engineer (Intern)",
    "title_zh": "机器学习工程师（实习）",
    "company_en": "iFLYTEK Co., Ltd.",
    "company_zh": "科大讯飞",
    "period_en": "Apr 2024 – Aug 2025",
    "period_zh": "2024 年 4 月 – 2025 年 8 月",
    "location_en": "Hefei, China",
    "location_zh": "中国，合肥",
    "bullets_en": [
      "Engineered sophisticated system prompts and few-shot learning templates for the Xinghuo LLM, optimizing performance for financial Q&A, dialogue summarization, and multi-intent recognition tasks.",
      "Conducted technical feasibility studies on state-of-the-art AI Agent frameworks (e.g., AutoGPT, ReAct); prototyped agentic workflows to evaluate their integration into existing enterprise-level production environments.",
      "Developed an end-to-end automation framework for generating Financial Due Diligence reports, integrating web-scraping for article collection, LLM-driven content generation, and automated format validation to reduce manual reporting time."
    ],
    "bullets_zh": [
      "针对“星火大模型”主导复杂 Prompt Engineering 与 Few-shot 学习模板设计，显著提升模型在金融问答、对话摘要及多意图识别任务中的性能表现。",
      "对 AutoGPT、ReAct 等前沿 AI Agent 框架进行技术可行性调研，完成 Agentic Workflow（智能体工作流）的原型开发，评估其在企业级生产环境中的集成与落地潜力。",
      "研发财务尽职调查（Due Diligence）端到端自动化框架，深度集成网页爬虫、LLM 内容生成及自动格式校验逻辑，大幅缩减人工报告撰写周期。"
    ]
  },
  {
    "title_en": "Research Assistant - Applied Machine Learning and Federated Learning",
    "title_zh": "研究助理 - 应用机器学习与联邦学习",
    "company_en": "University of British Columbia",
    "company_zh": "英属哥伦比亚大学",
    "period_en": "Sept 2023 - Apr 2024",
    "period_zh": "2023 年 9 月 - 2024 年 4 月",
    "location_en": "Vancouver, Canada",
    "location_zh": "加拿大，温哥华",
    "bullets_en": [
      "Optimized deep learning architectures for the MedFM Medical Image Classification Challenge, achieving 80% accuracy on multi-domain medical datasets through advanced data curation and model fine-tuning.",
      "Developed a Byzantine-robust Federated Learning aggregation strategy to mitigate poisoning attacks by implementing a dynamic weighting mechanism that identifies malicious clients via analysis of current and historical update trajectories.",
      "Evaluated FL vulnerabilities by engineering an adversarial attack framework that simulates sophisticated poisoning (mimicking benign client behaviour), degrading global model accuracy by ~5% in experiments."
    ],
    "bullets_zh": [
      "针对 MedFM 医疗影像分类挑战赛优化深度学习架构，通过高级数据清洗与模型微调，在多域医疗数据集上实现 80% 的分类准确率。",
      "设计并实现一种具备“拜占庭抗性（Byzantine-robust）”的联邦学习聚合策略，通过分析节点更新的历史轨迹建立动态加权机制，有效识别并拦截恶意客户端的投毒攻击。",
      "工程化实现一套对抗性攻击框架以评估联邦学习的脆弱性，模拟高隐蔽性的投毒行为（模仿良性行为），在实验环境下使全局模型准确率下降约 5%，为防御机制的优化提供依据。"
    ]
  },
  {
    "title_en": "Software Engineer (Intern)",
    "title_zh": "软件工程师（实习）",
    "company_en": "S.F. EXPRESS CO. LTD",
    "company_zh": "顺丰速运",
    "period_en": "May 2023 – Aug 2023",
    "period_zh": "2023 年 5 月 – 2023 年 8 月",
    "location_en": "Shenzhen, China",
    "location_zh": "中国，深圳",
    "bullets_en": [
      "Architected an automated evaluation pipeline to trigger LLM inference on large-scale datasets and programmatically benchmark outputs against ground-truth labels, streamlining the model validation lifecycle through automated performance analytics and Excel reporting.",
      "Engineered a multi-tier dashboard (Frontend & Backend) enabling regional managers to query delivery worker compliance; implemented a hierarchical data-fetching API and complex filtering logic to manage provincial and city-level data granularity.",
      "Architected an integrated automation suite using Selenium and Pytest to conduct end-to-end (E2E) testing across frontend and backend APIs; validated 300+ functional points and achieved 90% code coverage across unit and integration test suites to ensure system-wide stability."
    ],
    "bullets_zh": [
      "设计并落地 LLM 自动化评估流水线，支持大规模数据集的并行推理及与 Ground-truth 标签的编程化比对，通过自动化性能分析与 Excel 报表产出，极大地缩短了模型验证周期。",
      "开发多端合规监控驾驶舱（Dashboard），赋能地区管理者实时查询配送员操作合规性；设计并实现分层数据检索 API 与复杂过滤逻辑，支持省、市、区多级粒度的数据穿透查询。",
      "基于 Selenium 与 Pytest 构建集成化自动化测试套件，执行全链路端到端（E2E）测试。覆盖 300 多个核心功能点，实现 90% 以上的单元与集成测试覆盖率，确保了系统级稳定性。"
    ]
  },
  {
    "title_en": "Computer Science Tutor (Java)",
    "title_zh": "计算机科学导师（Java）",
    "company_en": "Look4Tutor",
    "company_zh": "Look4Tutor",
    "period_en": "Sept 2022 – Dec 2022",
    "period_zh": "2022 年 9 月 – 2022 年 12 月",
    "location_en": "Vancouver, Canada",
    "location_zh": "加拿大，温哥华",
    "bullets_en": [
      "Mentored engineering students in core software construction principles, focusing on Object-Oriented Design (OOD), architectural patterns, and Java-based system development within a rigorous 5-credit curriculum.",
      "Led instructional sessions on complex CS topics, including Abstract Data Types (ADTs), Design Patterns (Factory, Singleton, Strategy), and Concurrency, emphasizing thread safety and memory management.",
      "Conducted intensive code reviews for student projects, identifying logical bottlenecks and guiding the implementation of scalable, maintainable, and testable code through industry-standard best practices."
    ],
    "bullets_zh": [
      "深度辅导工程专业学生掌握软件构建核心原则，重点传授面向对象设计（OOD）、架构模式及基于 Java 的系统开发方案。",
      "主持复杂 CS 课题的专题教学，涵盖抽象数据类型（ADTs）、经典设计模式（工厂、单例、策略）及多线程并发编程，强调线程安全与内存管理优化。",
      "对学生项目进行深度代码审查（Code Review），识别逻辑瓶颈并指导实施可扩展、可维护且可测试的高质量代码，沉淀行业标准最佳实践。"
    ]
  }
]
